package hometask06;

// Реализуйте структуру телефонной книги с помощью HashMap.
// Программа также должна учитывать, что в во входной структуре будут повторяющиеся имена с разными телефонами,
// их необходимо считать, как одного человека с разными телефонами.
// Вывод должен быть отсортирован по убыванию числа телефонов.
// Подсказка - для сортировки можно использовать компаратор. https://javarush.com/groups/posts/2262-comparator-v-java

public class Main {
    public static void main(String[] args) {
        Menu.userChoice();
    }
}
